Revit 2027 API
BuiltInFailures.SharedCoordinatesFailures Class
 Failures about shared coordinates.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.SharedCoordinatesFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class SharedCoordinatesFailures
Public NotInheritable Class SharedCoordinatesFailures
public ref class SharedCoordinatesFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SharedCoordinatesFailures = class end
The BuiltInFailures.SharedCoordinatesFailures type exposes the following members.
Properties
Name | Description
CannotAcquireCoordinatesFromLinkWithScaledLocation |  Can't acquire coordiantes from a link that has a scaled location.
CannotAcquireCoordinatesFromScaledLink |  Can't acquire coordinates from a link that is scaled.
Top
See Also
Reference
Autodesk.Revit.DB Namespace